## [ DataFrame에 행/열 추가 ]

(1) 모듈 로딩 <hr>

In [149]:
import pandas as pd

(2) 데이터 준비 <hr>

In [150]:
# dict 타입의 데이터 생성
exam = {'이름': ['혜인','민지','하니','해린'], 
        '국어' : [77, 88, 99, 100], 
        '미술' : [17, 18, 19, 10],
        '수학' : [27, 28, 29, 20], 
        '체육' : [37, 38, 39, 30]}

(3) DataFrame에 데이터 저장 <hr>

In [151]:
examDF = pd.DataFrame(exam)

In [152]:
examDF

   이름   국어  미술  수학  체육
0  혜인   77  17  27  37
1  민지   88  18  28  38
2  하니   99  19  29  39
3  해린  100  10  20  30

(4) 저장된 데이터 속성 확인 <hr>

In [153]:
def printAttribute(df, dfname):
    print(f'[ {dfname} ]')
    print(f'index\n=====> {df.index}')
    print(f'columns\n====> {df.columns}')
    print(f'shape\n=====> {df.shape}')
    print(f'ndim\n=====> {df.ndim}')
    print(f'dtypes\n=====>\n{df.dtypes}')         #이러케 되면 시리즈가 출력된다!
printAttribute(examDF, 'examDF')

[ examDF ]
index
=====> RangeIndex(start=0, stop=4, step=1)
columns
====> Index(['이름', '국어', '미술', '수학', '체육'], dtype='object')
shape
=====> (4, 5)
ndim
=====> 2
dtypes
=====>
이름    object
국어     int64
미술     int64
수학     int64
체육     int64
dtype: object

(5) DataFrame에 컬럼(Column) 추가 <hr>
- 방법: DF객체변수명[새로운컬러명] = 값

In [154]:
examDF.columns

Index(['이름', '국어', '미술', '수학', '체육'], dtype='object')

In [155]:
# 행 개수만큼 값 추가
examDF['영어'] = [11, 22, 33, 44]

In [156]:
examDF

   이름   국어  미술  수학  체육  영어
0  혜인   77  17  27  37  11
1  민지   88  18  28  38  22
2  하니   99  19  29  39  33
3  해린  100  10  20  30  44

In [157]:
# 1개의 데이터 즉 값 추가시 모든 행에 동일값으로 저장
examDF['과학'] = 10
#[10] 이거는 1개만 준거라 에러발생
examDF

   이름   국어  미술  수학  체육  영어  과학
0  혜인   77  17  27  37  11  10
1  민지   88  18  28  38  22  10
2  하니   99  19  29  39  33  10
3  해린  100  10  20  30  44  10

(6) DataFrame에 행(row) 추가 <hr>
- 방법: DF객체변수명.loc[새로운 행인덱스] = [컬럼 수 만큼의 데이터]
- 방법: DF객체변수명.loc[새로운 행인덱스] = 데이터
- 불가 방법: DF객체변수명.iloc[새로운 행인덱스] = 데이터 => 데이터 존재해야지 인덱스 할당됨

In [158]:
examDF.index

RangeIndex(start=0, stop=4, step=1)

In [159]:
# 컬럼수만큼의 데이터를 가진 행 추가
examDF.loc[4] = ['다니엘', 90, 87, 77, 67, 57, 47]

In [160]:
examDF

    이름   국어  미술  수학  체육  영어  과학
0   혜인   77  17  27  37  11  10
1   민지   88  18  28  38  22  10
2   하니   99  19  29  39  33  10
3   해린  100  10  20  30  44  10
4  다니엘   90  87  77  67  57  47

In [161]:
# 행 추가시 iloc는 사용불가 = why? 데이터 수에 맞게 인덱스 범위 지정이 되기 떄문에
# 현재 인덱스에 없는 인덱스로 불가
#examDF.iloc[5] = ['방시혁', 90, 87, 77, 67, 57, 47]

In [162]:
# 1개 데이터 가진 행 추가
examDF.loc[5] = '방시혁'

In [163]:
examDF

    이름   국어   미술   수학   체육   영어   과학
0   혜인   77   17   27   37   11   10
1   민지   88   18   28   38   22   10
2   하니   99   19   29   39   33   10
3   해린  100   10   20   30   44   10
4  다니엘   90   87   77   67   57   47
5  방시혁  방시혁  방시혁  방시혁  방시혁  방시혁  방시혁